2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/EIOuderInDoelbinding-TC02-2-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670020</ABONNEMENT>
            <NAAM>Mutaties op personen van wie u de bijhoudingspartij heeft id 25003</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>505003</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Mutaties op personen van wie u de bijhoudingspartij heeft id 25003</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>01001</brp:code>
    <brp:naam>Geboorte in Nederland</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>505003</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1982-05-28</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>800011375</brp:burgerservicenummer>
          <brp:administratienummer>8080752068</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1982-05-28</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Paula</brp:voornamen>
          <brp:voorvoegsel>de</brp:voorvoegsel>
          <brp:scheidingsteken> </brp:scheidingsteken>
          <brp:geslachtsnaamstam>Prins</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datum>1982-05-28</brp:datum>
          <brp:gemeenteCode>0519</brp:gemeenteCode>
          <brp:woonplaatsnaam>Honselersdijk</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1982-05-28</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:betrokkenheden>
          <brp:ouder brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:verwerkingssoort="Toevoeging" brp:objectSleutel="*">
              <brp:relatie brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:relatie>
              <brp:betrokkenheden>
                <brp:kind brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                  <brp:actieInhoud>*</brp:actieInhoud>
                  <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Toevoeging">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
					  <brp:actieInhoud>*</brp:actieInhoud>					  
                      <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>809468852</brp:burgerservicenummer>
                      <brp:administratienummer>1010103835</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
					  <brp:actieInhoud>*</brp:actieInhoud>
                      <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>XYZ</brp:voornamen>
                      <brp:geslachtsnaamstam>Vlag</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
					  <brp:actieInhoud>*</brp:actieInhoud>
                      <brp:datum>${vandaag()}</brp:datum>
                      <brp:gemeenteCode>1773</brp:gemeenteCode>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                  </brp:persoon>
                </brp:kind>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:ouder>
        </brp:betrokkenheden>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>